{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}netivreg output log
       {txt}log:  {res}C:\Users\lfsanche\OneDrive\1_WP\Net_ivreg\netivreg\netivregOUT_l.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Oct 2024, 12:11:03
{txt}
{com}. 
. *-- Load Nodes Simulated Data
. use data/data_sim.dta, clear
{txt}
{com}. format y_endo y_exo x1 x2 x3 x4 %9.3f
{txt}
{com}. list in 1/5, table 
{txt}
     {c TLC}{hline 4}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c TRC}
     {c |} {res}id   y_exo   y_endo       x1      x2       x3       x4 {txt}{c |}
     {c LT}{hline 4}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c RT}
  1. {c |} {res} 1   4.072    4.555   -0.523   0.926    2.136   -0.546 {txt}{c |}
  2. {c |} {res} 2   4.584    4.665    2.611   1.455   -0.926    0.759 {txt}{c |}
  3. {c |} {res} 3   3.887    3.671    3.125   0.513   -2.718   -2.132 {txt}{c |}
  4. {c |} {res} 4   3.736    3.962   -2.674   1.504    1.769    0.091 {txt}{c |}
  5. {c |} {res} 5   6.360    7.002   -0.993   0.345    1.126    1.120 {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c -}{hline 7}{c -}{hline 8}{c -}{hline 8}{c BRC}

{com}. 
. *-- Load W Simulated Data
. use data/W_sim.dta, clear
{txt}
{com}. list in 113/117, table 
{txt}
     {c TLC}{hline 8}{c -}{hline 8}{c TRC}
     {c |} {res}source   target {txt}{c |}
     {c LT}{hline 8}{c -}{hline 8}{c RT}
113. {c |} {res}    28      259 {txt}{c |}
114. {c |} {res}    28      361 {txt}{c |}
115. {c |} {res}    29       67 {txt}{c |}
116. {c |} {res}    29       79 {txt}{c |}
117. {c |} {res}    29      196 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 8}{c BRC}

{com}. 
. *-- Load W0 Simulated Data
. use data/W0_sim.dta, clear
{txt}
{com}. list in 113/117, table 
{txt}
     {c TLC}{hline 8}{c -}{hline 8}{c TRC}
     {c |} {res}source   target {txt}{c |}
     {c LT}{hline 8}{c -}{hline 8}{c RT}
113. {c |} {res}    30      167 {txt}{c |}
114. {c |} {res}    30      325 {txt}{c |}
115. {c |} {res}    31       38 {txt}{c |}
116. {c |} {res}    31       83 {txt}{c |}
117. {c |} {res}    31      132 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 8}{c BRC}

{com}. 
. *-- netivreg: Exogenous (G2SLS)
. use data/data_sim.dta
{txt}
{com}. frame create edges
{txt}
{com}. frame edges: use data/W_sim.dta
{txt}
{com}. netivreg g3sls y_exo x1 x2 x3 x4 (edges = edges)
{err}  File "<stdin>", line 1
    def exec_netivreg(estimator, depvar, exovar, adjmat, adjmat0, wx, wz, id_,
                     ^
SyntaxError: '(' was never closed
(119 lines skipped)
{com}(error occurred while loading netivreg.ado)
{txt}{search r(7102), local:r(7102);}

end of do-file

{search r(7102), local:r(7102);}

{com}. clear

. exit
{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. clear

. exit
